      ******************************************************************
      * Author: Cristian Silva
      * Date: 24/10/2020
      * Purpose: Cobol em 2020 bixo, mds
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. TRAINING-PROGRAM-1.
      *>  AUTHOR. CRISTIAN SILVA.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM TRAINING-PROGRAM-1.
